### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
pd_series = pd.Series([4,8,15,16,23,42])

In [3]:
pd_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(pd_series)

pandas.core.series.Series

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
import numpy as np

data = np.random.randint(20,50,size = 10)

In [6]:
data

array([29, 40, 38, 36, 38, 44, 23, 45, 35, 47])

In [7]:
s = pd.Series(data)

In [8]:
s

0    29
1    40
2    38
3    36
4    38
5    44
6    23
7    45
8    35
9    47
dtype: int64

In [9]:
type(s)

pandas.core.series.Series

In [10]:
type(data)

numpy.ndarray

### Q3. Create a Pandas DataFrame that contains the following data: 

Name Alice
Bob
Claire
<br> 
Age
25
30
27
<br>
Gender
Female
Male
Female

In [11]:
data = {"Name" : ["Alice","Bob","Claire"],"Age" : [25,30,27],"Gender" : ["Female","Male","Female"]}

In [12]:
data

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [15]:
type(df)

pandas.core.frame.DataFrame

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional, tabular data structure that can store data of different types (numeric, string, boolean, etc.) in rows and columns. It is one of the most commonly used data structures in Pandas and is similar to a spreadsheet or a SQL table. A DataFrame is designed to handle structured data and offers a wide range of operations and functionalities for data manipulation, analysis, and cleaning.

On the other hand, a Pandas Series is a one-dimensional array-like data structure that can hold a single column of data with an associated index. Think of it as a labeled array. It is more similar to a list or a NumPy array, but with the added feature of an index, which allows for more powerful and efficient data alignment and labeling.

In [16]:
#using the same data from 3 question
data

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [17]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [18]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [19]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [20]:
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [21]:
type(df['Name'])

pandas.core.series.Series

In [22]:
df[['Name']]

     Name
0   Alice
1     Bob
2  Claire

In [23]:
type(df[['Name','Gender']])

pandas.core.frame.DataFrame

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

#### Handling Missing Data: You can handle missing values using functions like dropna or fillna.
#### Filtering Data: You can filter rows based on specific conditions using functions like loc, iloc
#### Sorting Data: You can sort the DataFrame by one or more columns using the sort_values function.
#### Aggregation: You can perform aggregate operations on specific columns using functions like mean, sum, min, max, etc.
#### Grouping Data: You can group data based on certain criteria and perform aggregate functions on each group using groupby.
#### Merging DataFrames: You can combine multiple DataFrames using functions like merge or join.We can perform left,right,outer,inner,cross

In [24]:
data = {'A': [1, 2, None, 4], 'B': [5, None, 7, 8]}
df = pd.DataFrame(data)

#### Handling Missing Data

In [25]:
df

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  7.0
3  4.0  8.0

In [26]:
# Drop rows with any missing value
clean_df = df.dropna()
clean_df

     A    B
0  1.0  5.0
3  4.0  8.0

In [27]:
# Filling rows with 3 in the missing values
cleann_df = df.fillna(3)
cleann_df

     A    B
0  1.0  5.0
1  2.0  3.0
2  3.0  7.0
3  4.0  8.0

#### Filtering Data

In [28]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [29]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [30]:
df.iloc[2:6]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [31]:
df.loc[2:6]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [32]:
#getting the rows based on the index numbers of the coloumn passed in the same order as passed
df.iloc[2:6 , [3,5,4,8,9]]

,Name,Age,Sex,Ticket,Fare
2,"Heikkinen, Miss. Laina",26.0,female,STON/O2. 3101282,7.9250
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,female,113803,53.1000
4,"Allen, Mr. William Henry",35.0,male,373450,8.0500
5,"Moran, Mr. James",NaN,male,330877,8.4583

In [33]:
#same use as iloc but the only difference is that it uses coloumn names for selecting coloumnar data
df.loc[2:6, ["Name","Sex","Age","Fare","Ticket"]]

,Name,Sex,Age,Fare,Ticket
2,"Heikkinen, Miss. Laina",female,26.0,7.9250,STON/O2. 3101282
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,113803
4,"Allen, Mr. William Henry",male,35.0,8.0500,373450
5,"Moran, Mr. James",male,NaN,8.4583,330877
6,"McCarthy, Mr. Timothy J",male,54.0,51.8625,17463

#### Sorting the data

In [34]:
#Descending order temporarily if want to make it permanaent add inplace = True
df.sort_values(by="Fare",ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0000,NaN,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0000,NaN,S
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0000,NaN,S

In [35]:
#Ascending order temporarily if want to make it permanaent add inplace = True
df.sort_values(by="Fare",ascending=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C

#### Aggregation of data

In [36]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [37]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [38]:
df['Age'].max()

80.0

In [39]:
df['Age'].min()

0.42

In [40]:
df['Age'].sum()

21205.17

In [41]:
df[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [42]:
df['Age'].std()

14.526497332334044

#### Grouping Data

In [43]:
df.groupby("Age").mean()

/tmp/ipykernel_5429/2125450506.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Age").mean()

       PassengerId  Survived  Pclass  SibSp  Parch      Fare
Age
0.42         804.0       1.0     3.0    0.0    1.0    8.5167
0.67         756.0       1.0     2.0    1.0    1.0   14.5000
0.75         557.5       1.0     3.0    2.0    1.0   19.2583
0.83         455.5       1.0     2.0    0.5    1.5   23.8750
0.92         306.0       1.0     1.0    1.0    2.0  151.5500
...            ...       ...     ...    ...    ...       ...
70.00        709.5       0.0     1.5    0.5    0.5   40.7500
70.50        117.0       0.0     3.0    0.0    0.0    7.7500
71.00        295.5       0.0     1.0    0.0    0.0   42.0792
74.00        852.0       0.0     3.0    0.0    0.0    7.7750
80.00        631.0       1.0     1.0    0.0    0.0   30.0000

[88 rows x 6 columns]

In [44]:
#grouping based on ranges
age_groups = pd.cut(df['Age'], bins=[10, 20, 30,40,50,60,70,80,np.inf])

In [45]:
df.groupby(age_groups).sum()

/tmp/ipykernel_5429/1504605077.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(age_groups).sum()

              PassengerId  Survived  Pclass     Age  SibSp  Parch       Fare
Age
(10.0, 20.0]        51481        44     291  1991.5     68     45  3395.8961
(20.0, 30.0]        98597        84     549  5847.5     74     55  6510.5453
(30.0, 40.0]        72647        69     324  5433.0     58     61  6586.8955
(40.0, 50.0]        41581        33     165  3902.0     32     37  3540.0336
(50.0, 60.0]        18892        17      64  2305.5     13     13  1880.5417
(60.0, 70.0]         7325         4      26  1086.0      3      6   780.4833
(70.0, 80.0]         2191         1       9   366.5      0      0   129.6834
(80.0, inf]             0         0       0     0.0      0      0     0.0000

In [46]:
df.groupby(age_groups)['Age'].mean()

Age
(10.0, 20.0]    17.317391
(20.0, 30.0]    25.423913
(30.0, 40.0]    35.051613
(40.0, 50.0]    45.372093
(50.0, 60.0]    54.892857
(60.0, 70.0]    63.882353
(70.0, 80.0]    73.300000
(80.0, inf]           NaN
Name: Age, dtype: float64

#### Merging DataFrames

In [47]:
data1 = pd.DataFrame({'key1':[1,2,4,5,6],
                      'key2':[4,5,6,7,8],
                      'key3':[3,4,5,6,6]
})

In [48]:
data2 = pd.DataFrame({'key1':[1,2,45,6],
                      'key4':[56,5,6,7],
                      'key5':[3,56,5,6]
}
)

In [49]:
data3 = pd.DataFrame({'key1':[1,2,4,5,6],
                      'key2':[4,5,6,7,8],
                      'key3':[3,4,5,6,6]},
                     index = ['a','b','c','d','e']
)

In [50]:
data4 = pd.DataFrame({'key11':[1,2,4,5,6],
                      'key22':[4,5,6,7,8],
                      'key33':[3,4,5,6,6]
},index=['a','b','h','i','j']
)

In [51]:
data1

   key1  key2  key3
0     1     4     3
1     2     5     4
2     4     6     5
3     5     7     6
4     6     8     6

In [52]:
data2

   key1  key4  key5
0     1    56     3
1     2     5    56
2    45     6     5
3     6     7     6

In [53]:
#by default its inner join
pd.merge(data1,data2)

   key1  key2  key3  key4  key5
0     1     4     3    56     3
1     2     5     4     5    56
2     6     8     6     7     6

In [54]:
pd.merge(data1,data2,how='outer')

   key1  key2  key3  key4  key5
0     1   4.0   3.0  56.0   3.0
1     2   5.0   4.0   5.0  56.0
2     4   6.0   5.0   NaN   NaN
3     5   7.0   6.0   NaN   NaN
4     6   8.0   6.0   7.0   6.0
5    45   NaN   NaN   6.0   5.0

In [55]:
#displying only 10 because it creates data1 creates new row for every row of data 2 
pd.merge(data1,data2,how='cross').head(10)

   key1_x  key2  key3  key1_y  key4  key5
0       1     4     3       1    56     3
1       1     4     3       2     5    56
2       1     4     3      45     6     5
3       1     4     3       6     7     6
4       2     5     4       1    56     3
5       2     5     4       2     5    56
6       2     5     4      45     6     5
7       2     5     4       6     7     6
8       4     6     5       1    56     3
9       4     6     5       2     5    56

In [56]:
pd.merge(data1,data2,how='left')

   key1  key2  key3  key4  key5
0     1     4     3  56.0   3.0
1     2     5     4   5.0  56.0
2     4     6     5   NaN   NaN
3     5     7     6   NaN   NaN
4     6     8     6   7.0   6.0

In [57]:
pd.merge(data1,data2,how = 'right')

   key1  key2  key3  key4  key5
0     1   4.0   3.0    56     3
1     2   5.0   4.0     5    56
2    45   NaN   NaN     6     5
3     6   8.0   6.0     7     6

In [58]:
pd.merge(data1,data2,how = 'left', on ="key1")

   key1  key2  key3  key4  key5
0     1     4     3  56.0   3.0
1     2     5     4   5.0  56.0
2     4     6     5   NaN   NaN
3     5     7     6   NaN   NaN
4     6     8     6   7.0   6.0

In [59]:
data3

   key1  key2  key3
a     1     4     3
b     2     5     4
c     4     6     5
d     5     7     6
e     6     8     6

In [60]:
data4

   key11  key22  key33
a      1      4      3
b      2      5      4
h      4      6      5
i      5      7      6
j      6      8      6

In [61]:
#join works on row index matching
data3.join(data4,how="left")

   key1  key2  key3  key11  key22  key33
a     1     4     3    1.0    4.0    3.0
b     2     5     4    2.0    5.0    4.0
c     4     6     5    NaN    NaN    NaN
d     5     7     6    NaN    NaN    NaN
e     6     8     6    NaN    NaN    NaN

In [62]:
#we can use all possible types of join available in the merge part
data3.join(data4,how="right")

   key1  key2  key3  key11  key22  key33
a   1.0   4.0   3.0      1      4      3
b   2.0   5.0   4.0      2      5      4
h   NaN   NaN   NaN      4      6      5
i   NaN   NaN   NaN      5      7      6
j   NaN   NaN   NaN      6      8      6

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are mutable in nature, while Panel is not mutable.

Series: A Pandas Series is mutable, meaning you can change the elements in the series after it has been created. You can modify, add, or delete elements in a Series.

DataFrame: A Pandas DataFrame is also mutable. You can change the values of individual cells, add or remove columns, and perform various data manipulations on the DataFrame.

Panel: A Panel is a three-dimensional data structure in Pandas, which could be thought of as a dictionary of DataFrames. Unlike Series and DataFrame, a Panel is not mutable, meaning you cannot change its elements once it is created.

In [63]:
data = {"Name" : ["Alice","Bob","Claire"],"Age" : [25,30,27],"Gender" : ["Female","Male","Female"]}

In [64]:
df = pd.DataFrame(data)

In [65]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [66]:
series_age = df['Age']
print(series_age)
print("\n")
print(type(series_age))

0    25
1    30
2    27
Name: Age, dtype: int64


<class 'pandas.core.series.Series'>

In [67]:
#shows that series are mutable
#series_agee =pd.Series(series_age) - to remove warning
series_age[2]= 42

/tmp/ipykernel_5429/1204556753.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  series_age[2]= 42

In [68]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   42  Female

In [69]:
[df['Name'] == 'Bob', 'Age']

[0    False
 1     True
 2    False
 Name: Name, dtype: bool,
 'Age']

In [70]:
#modify age of bob
df.loc[df['Name'] == 'Bob', 'Age'] = 31

In [71]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   31    Male
2  Claire   42  Female

In [72]:
#adding new coloumn grade
df['Grade'] = [85, 90, 78]

In [73]:
df

     Name  Age  Gender  Grade
0   Alice   25  Female     85
1     Bob   31    Male     90
2  Claire   42  Female     78

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [77]:
names = pd.Series(["Rachit","Yomil","Pratham","Sakshi"])
age = pd.Series([22,21,22,20])
gender = pd.Series(['M','M','M','F'])

In [78]:
names

0     Rachit
1      Yomil
2    Pratham
3     Sakshi
dtype: object

In [79]:
age

0    22
1    21
2    22
3    20
dtype: int64

In [80]:
gender

0    M
1    M
2    M
3    F
dtype: object

In [83]:
df = pd.DataFrame({"Names":names,"Age":age,"Gender":gender})

In [84]:
df

     Names  Age Gender
0   Rachit   22      M
1    Yomil   21      M
2  Pratham   22      M
3   Sakshi   20      F